<?php
include "tokens.php";
$path = "https://api.telegram.org/bot" . TOKEN;
$data = file_get_contents('php://input');
$data = json_decode($data, true);
$text = null;
$str = null;
file_put_contents(__DIR__ . '/message.txt', print_r($data, true));
if (!empty($data['message']['text'])) {
    $text = $data['message']['text'];
}

switch ($text) {
    case 'Привіт, хто ти?':
        $str = "Привіт! Я бот, який вміє розмовляти";
        break;
    case 'Розкажи про PHP' || '/php':
        $str = "PHP — C-подібна скриптова мова загального призначення, що інтенсивно використовується для розробки веб-додатків. В даний час підтримується переважна більшість хостинг-провайдерів і є одним з лідерів серед мов, що застосовуються для створення динамічних веб-сайтів.";
        break;
    case 'Розкажи про Javascript' || '/js':
        $str = "JavaScript - мультипарадигмова мова програмування. Підтримує об'єктно-орієнтований, імперативний та функціональний стилі. Є реалізацією специфікації ECMAScript. JavaScript зазвичай використовується як вбудована мова для програмного доступу до об'єктів додатків.";
        break;
    case 'Розкажи про /c++' || '/c++':
        $str = "C++ - компілювана, статично типізована мова програмування загального призначення. Підтримує такі парадигми програмування, як процедурне програмування, об'єктно-орієнтоване програмування, узагальнене програмування.";
        break;        
    default:
        $str = "Що ви хочете вибрати?";
        break;
}
file_get_contents($path . "/sendmessage?chat_id=" . CHAT_ID . "&text=$str, " . $text);
